tap "buo/cask-upgrade"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"

### Formulae ###

# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Add GitHub support to git on the command-line
brew "hub"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Symlink dotfiles to home dir
brew "stow"
# CLI tool that moves files or folder to the trash
brew "trash"
# View directory tree in Terminal
brew "tree"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
# brew "koekeishiya/formulae/yabai", args: ["HEAD"]

### Casks ###

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
# cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Team Video chat
cask "around"
# Multi-track audio editor and recorder
cask "audacity"
# 2 Factor Authentication app
cask "authy"
# Simulating screen resolution for Apple Silicon Macs
cask "betterdisplay"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Automation tool to open multiple applications
cask "bunch"
# Screen capturing tool
cask "cleanshot"
# World clock application
cask "clocker"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
# cask "docker"
# Client for the Dropbox cloud storage service
# cask "dropbox"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Calendar software
# cask "fantastical"
# Collaborative design software
cask "figma"
# Developer targeted fonts with a high number of glyphs
cask "font-agave-nerd-font"
cask "font-asap"
cask "font-barlow"
cask "font-catamaran"
# Developer targeted fonts with a high number of glyphs
cask "font-code-new-roman-nerd-font"
# Low-contrast humanist sans-serif font with almost classical proportions
cask "font-commissioner"
cask "font-dm-mono"
cask "font-dm-sans"
# Sans serif variable font with a weight axis
cask "font-epilogue"
cask "font-fira-sans"
# Corporate typeface for IBM
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-inconsolata"
cask "font-inter"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-jost"
cask "font-karla"
cask "font-mukta"
cask "font-nunito-sans"
cask "font-overpass"
cask "font-overpass-mono"
cask "font-red-hat-text"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
cask "font-roboto-mono"
cask "font-sen"
cask "font-source-code-pro"
cask "font-space-grotesk"
# Typeface originally designed for the art center Synesthésie
cask "font-syne"
cask "font-work-sans"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
# cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Automation software
cask "keyboard-maestro"
# GPU-based terminal emulator
# cask "kitty"
# App to manage software development and track bugs
# cask "linear-linear"
# Mouse control software
# cask "logi-options-plus"
# Screen and video recording software
# cask "loom"
# Facebook Messenger desktop App
cask "messenger"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# App launcher with integrations
cask "raycast"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# keyboard navigation for MacOS
cask "shortcat"
# Microphone software
cask "shureplus-motiv"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
